const { SlashCommandBuilder, EmbedBuilder } = require("discord.js");
const commandReplyText = `### Команди: \n \n \`/xp:\` за допомогою цієї команди Ви можете подивитися свій рівень та рівень свого друга 😉 \n \`/edit-xp:\` якщо ти адміністратор або модератор, у вас є можливість редагувати кількість xp в інших учасників 🤭 \n \n Поширені питання: \n \n \`За що можна отримати бали?\` \n **·** За повідомлення які довше за 3 літери і не містять спаму 💬\n **·** Якщо ви були присутні у голосовому чаті в якому 4 та більше осіб 📢\n **·** За голосовий чат в якому був присутній адміністратор або модератор 🎙️\n **·** Запрошення користувача на сервер за умови, що він пробув на сервері більше місяця 🥂\n **·** За буст серверу(бали нарахуються незважаючи на добовий ліміт балів) 💸\n \n \`Який добовий ліміт балів?\` \n **·** Добовий ліміт балів становить 150 ❌\n \n `;

module.exports = {
  data: new SlashCommandBuilder()
    .setName("info")
    .setDescription("Bot capabilities"),

  async execute(interaction) {
    // interaction.reply(commandReplyText);
    const embed = new EmbedBuilder()
      .setTitle(`Що вміє цей бот?`)

      .setColor("#00FF7F")
      .setFields(
        {
          name: `**Команди:**`,
          value: `\`/xp:\` за допомогою цієї команди Ви можете подивитися свій рівень та рівень свого друга 😉 
          \`/edit-xp:\` якщо ти адміністратор або модератор, у вас є можливість редагувати кількість xp в інших учасників 🤭 \n`,
        },
        {
          name: `**Поширені питання:**`,
          value: `\`За що можна отримати бали?\``,
        }
      );

    interaction.reply({ embeds: [embed] });
  },
};
