const { SlashCommandBuilder, EmbedBuilder } = require("discord.js");
// const commandReplyText = `### Команди: \n \n \`/xp:\` за допомогою цієї команди Ви можете подивитися свій рівень та рівень свого друга 😉 \n \`/edit-xp:\` якщо ти адміністратор або модератор, у вас є можливість редагувати кількість xp в інших учасників 🤭 \n \n Поширені питання: \n \n \`За що можна отримати бали?\` \n **·** За повідомлення які довше за 3 літери і не містять спаму 💬\n **·** Якщо ви були присутні у голосовому чаті в якому 4 та більше осіб 📢\n **·** За голосовий чат в якому був присутній адміністратор або модератор 🎙️\n **·** Запрошення користувача на сервер за умови, що він пробув на сервері більше місяця 🥂\n **·** За буст серверу(бали нарахуються незважаючи на добовий ліміт балів) 💸\n \n \`Який добовий ліміт балів?\` \n **·** Добовий ліміт балів становить 150 ❌\n \n `;

module.exports = {
  data: new SlashCommandBuilder()
    .setName("info")
    .setDescription("Можливості боту"),

  async execute(interaction) {
    let currentColor = "";
    const currentMonth = new Date().getMonth();

    switch (currentMonth) {
      case 11:
      case 0:
      case 1:
        currentColor = "#87CEEB";
        break;

      case 2:
      case 3:
      case 4:
        currentColor = "#D8BFD8";
        break;

      case 5:
      case 6:
      case 7:
        currentColor = "#98FF98";
        break;

      case 8:
      case 9:
      case 10:
        currentColor = "#FFC73E";
        break;
    }
    
    const embed = new EmbedBuilder()
      .setTitle(`Що вміє цей бот?`)
      .setColor(currentColor)
      .setFields(
        {
          name: `**Команди:**`,
          value: `\u200B\n \`/xp:\` за допомогою цієї команди Ви можете подивитися свій рівень та рівень свого друга 😉 \n \`/edit-xp:\` якщо Ви адміністратор або модератор, у Вас є можливість редагувати кількість xp в інших учасників 🤭 \n \`/leaders:\` з цією командою ви можете побачити рейтинг учасників 🏆`,
        },
        {
          name: `**Поширені питання:**`,
          value: `\u200B\n \`За що можна отримати бали?\` \n **·** За повідомлення які довше за 3 літери і не містять спаму 💬 \n **·** Якщо ви були присутні у голосовому чаті в якому 4 та більше осіб 📢 \n **·** За голосовий чат в якому був присутній адміністратор або модератор 🎙️ \n **·** Запрошення користувача на сервер за умови, що він пробув на сервері більше місяця 🥂 \n **·** За буст серверу(бали нарахуються незважаючи на добовий ліміт балів) 💸 \n \n \`Який добовий ліміт балів?\` \n **·** Добовий ліміт балів становить 150 ❌ \n \n \`За що знімаються бали?\` \n **·** За спам 🗿\n **·** За нецензурну лексику 👺\n \n \`За що не нараховуються бали?\` \n **·** Надсилання зображень 🖼️\n **·** Видалення повідомлень 💌`,
        }
      );

    interaction.reply({ embeds: [embed] });
  },
};

//// 00FF7F light toxic green
//// FFBF00 toxic honey
// FFC73E honey(autumn)
//// 7CFC00 toxic green
// 98FF98 minty(summer)
// D8BFD8 lavander(spring)
// 87CEEB cristal blue(winter)
